Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType
The Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType enum specifies all possible line types.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType.Solid
The solid line type.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType.Dashed1
The first dashed line type.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType.Dashed2
The second dashed line type.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType.DashedAndDotted
The dashed and dotted line type.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotLineType.Dotted
The dotted line type.